In [1]:
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series(np.arange(5), index=[1,2,3,4,5])

In [4]:
s1

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [5]:
#drop is based on index from Series

In [6]:
s1.drop(4)

1    0
2    1
3    2
5    4
dtype: int64

In [7]:
#drop from dataframe

In [9]:
df1 = pd.DataFrame(np.random.randn(4,5), index=['r1','r2','r3','r4'], columns=['c1','c2','c3','c4','c5'])

In [10]:
df1

          c1        c2        c3        c4        c5
r1 -0.942861 -1.053694 -1.127535  0.005600  1.377905
r2  0.309113 -1.365408 -1.280099 -0.498523  1.445974
r3 -0.042616 -0.456766  0.047291  0.694246 -0.386571
r4  0.075793 -0.502454 -0.200924 -0.582760  2.114355

In [11]:
df1.drop('r1') #drop based on index

          c1        c2        c3        c4        c5
r2  0.309113 -1.365408 -1.280099 -0.498523  1.445974
r3 -0.042616 -0.456766  0.047291  0.694246 -0.386571
r4  0.075793 -0.502454 -0.200924 -0.582760  2.114355

In [12]:
df1.drop('c5', axis=1)

          c1        c2        c3        c4
r1 -0.942861 -1.053694 -1.127535  0.005600
r2  0.309113 -1.365408 -1.280099 -0.498523
r3 -0.042616 -0.456766  0.047291  0.694246
r4  0.075793 -0.502454 -0.200924 -0.582760

In [13]:
df1 # drop function doesn't change df1

          c1        c2        c3        c4        c5
r1 -0.942861 -1.053694 -1.127535  0.005600  1.377905
r2  0.309113 -1.365408 -1.280099 -0.498523  1.445974
r3 -0.042616 -0.456766  0.047291  0.694246 -0.386571
r4  0.075793 -0.502454 -0.200924 -0.582760  2.114355

In [15]:
df1.drop('c5', axis=1, inplace=True)#true means replace original df1

In [16]:
df1

          c1        c2        c3        c4
r1 -0.942861 -1.053694 -1.127535  0.005600
r2  0.309113 -1.365408 -1.280099 -0.498523
r3 -0.042616 -0.456766  0.047291  0.694246
r4  0.075793 -0.502454 -0.200924 -0.582760